# 17. Решение в группах
# Дан список чисел. Определите, сколько в нем
# встречается различных чисел.
# Input: [1, 1, 2, 0, -1, 3, 4, 4]
# Output: 6

list1 = [1,1,2,0,1,1,2]
list2 = [1,2,2,0,3,4,2]
set1 = set(list1)
set2 = set(list2)
print(set1)
print(len(set1))
print(set2)
print(len(set2))
# print(set1[1])